W7D2/MusicApp/app/controllers/albums_controller.rb

    def show
        @album = Album.find_by(id: params[:id])
        @tracks = Track.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks"

    def create
        @album = Album.new(album_params)
        if @album.save!
---
INSERT INTO "albums" ("title", "yr", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "pandit"], ["yr", 2012], ["band_id", 4], ["created_at", "2020-09-12 01:19:59.812942"], ["updated_at", "2020-09-12 01:19:59.812942"]]

    def update
        @album = Album.find_by(id: params[:id])
        if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "studio" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["studio", true], ["updated_at", "2020-09-09 22:35:43.123271"], ["id", 1]]

    def destroy
        @album = Album.find_by(id: params[:id])
        @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]