W7D2/MusicApp/app/controllers/bands_controller.rb

    def show
        @band = Band.find_by(id: params[:id])
        @albums = Album.all
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"