W7D2/MusicApp/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("title", "ord", "album_id", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "cool"], ["ord", 5], ["album_id", 2], ["lyrics", "So cool"], ["created_at", "2020-09-09 23:57:46.105705"], ["updated_at", "2020-09-09 23:57:46.105705"]]
---
    def create
        @track = Track.new(track_params)
        if @track.save!

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]
---
    def destroy
        @track = Track.find_by(id: params[:id])
        @album = @track.album
        @track.destroy