W6D4/FirstRoutesAndControllers Day 2/app/controllers/artworks_controller.rb

    def index

        artworks = Artwork.all

        user = User.find_by(id: params[:user_id])
---
SELECT "artworks".* FROM "artworks"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "title" = $2, "image_url" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["artist_id", 31], ["title", "Starry Night"], ["image_url", "starrynight.com"], ["updated_at", "2020-09-03 22:22:07.504933"], ["id", 6]]

    def destroy
        artwork = Artwork.find_by(id: params[:id])
        if artwork.nil?
            render json: "Artwork doesn't exist.", status: 404
        else
            render json: artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]