W6D3/FirstRoutesAndControllers/app/controllers/users_controller.rb

    def create
        # User.create(
        #     username: params[:username],
        #     email: params[:email],
        #     age: params[:age],
        #     political_affiliation: params[:political_affiliation])
        user = User.new(user_params)
        if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Four"], ["email", "4@gmail.com"], ["created_at", "2020-09-02 22:34:33.575264"], ["updated_at", "2020-09-02 22:34:33.575264"]]

    def destroy
        user = User.find_by(id: params[:id])
        if user.nil?
            render json: "User doesn't exist.", status: 404
        else
            render json: user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]