W6D5/ninety_nice_cats/app/controllers/cats_controller.rb

    def show
        @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @kitty = Cat.find_by(id: params[:id])
        if @kitty.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["birth_date", "2020-09-03"], ["updated_at", "2020-09-07 21:27:00.989465"], ["id", 1]]

    def edit
        @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]